huxiansheng1130/PY32F002B_Remote/Templates/PY32F002Bxx_Remote/Src/main.h
/**
  ******************************************************************************
  * @file    main.h
  * @author  MCU Application Team
  * @brief   Header for main.c file.
  *          This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f002b_ll_rcc.h"
#include "py32f002b_ll_bus.h"
#include "py32f002b_ll_system.h"
#include "py32f002b_ll_cortex.h"
#include "py32f002b_ll_utils.h"
#include "py32f002b_ll_pwr.h"
#include "py32f002b_ll_gpio.h"
#include "py32f002b_ll_tim.h"
#include "py32f002b_ll_exti.h"
#include "py32f002b_bsp_clock.h"
#include "py32f002b_bsp_printf.h"
#include "py32f002b_ll_tim.h"
#include "SEGGER_RTT.h"

/* GCC common typedef -----------------------------------------------------------*/
#include "app.h"

/* Private typedef -----------------------------------------------------------*/
#include "../keyboard_module/keyboard_handle.h"
#include "../keyboard_module/keyboard_driver.h"
#include "../function_module/function_handle.h"
#include "../flash_module/flash_handle.h"
#include "../power_module/power_driver.h"
#include "../ntc_module/ntc_driver.h"
#include "../led_module/led_driver.h"
#include "../gyro_module/qmi8658a_driver.h"
#include "../rf_433_module/433_send_driver.h"


#if defined(USE_FULL_ASSERT)
#include "py32_assert.h"
#endif /* USE_FULL_ASSERT */

void APP_ErrorHandler(void);

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
